valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9871QXA20/adc2.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) Infineon Technologies AG
 * All rights reserved.
 *
 * The applicable license agreement can be found at this pack's installation directory in the file
 * license/IFX_SW_Licence_MOTIX_LITIX.txt
 *
 **********************************************************************************************************************/
/**
 * \file     adc2.h
 *
 * \brief    ADC2 low level access library
 *
 * \version  V0.2.7
 * \date     02. Jan 2025
 *
 * \note This file violates [MISRA Rule 45]
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** DM           Daniel Mysliwitz                                              **
** DCM          Dragos C. Molocea                                             **
** BG           Blandine Guillot                                              **
** JO           Julia Ott                                                     **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V0.1.0: 2014-05-13, DM:   Initial version                                  **
** V0.1.1: 2014-09-11, DM:   ADC2->TH6_9_LOWER added to Init function         **
** V0.1.2: 2015-02-10, DM:   Individual header file added                     **
** V0.1.3: 2015-02-24, DM:   Comment for TH6_9_UPPER added                    **
** V0.1.4: 2015-07-16, DM:   GetChResult/GetSwModeResult result register      **
**                           address calculation corrected                    **
** V0.1.5: 2017-01-23, DM:   MMODE and Hysteresis added                       **
** V0.1.6: 2017-07-13, DM:   ADC2_VCCP_Result_mV() renamed to                 **
**                           ADC2_VDDC_Result_mV()                            **
**                           Double declaration of ADC2_Temp_Result_C removed **
** V0.1.7: 2017-09-26, DM:   ADC2_TEMP_WARN_Int_En/Dis macros renamed to      **
**                           ADC2_Temp_Warn_Int_En/Dis                        **
**                           MISRA 2012 compliance, the following PC-Lint     **
**                           rules are globally deactivated:                  **
**                           - Info 793: ANSI/ISO limit of 6 'significant     **
**                             characters in an external identifier           **
**                           - Info 835: A zero has been given as right       **
**                             argument to operator                           **
**                           - Info 845: The left argument to operator '&'    **
**                             is certain to be 0                             **
**                           Replaced macros by INLINE functions              **
**                           Replaced register accesses within functions by   **
**                           function calls                                   **
**                           Replaced __STATIC_INLINE by INLINE               **
** V0.1.8: 2018-07-03, DCM:  Conversion formula from digital value to mV      **
**                           changed based on the software unit test findings **
**                           and simplified according to the new spec         **
** V0.1.9: 2018-11-27, JO:   Moved revision history from adc2.c to adc2.h     **
**                           Included tle_variants.h instead of tle_device.h  **
**                           Added include io.which was included by           **
**                           tle_device.h indirectly                          **
** V0.2.0: 2019-09-10, JO:   Added initialization of ADC2->FILT_LO_CTRL and   **
**                           ADC2->FILT_UP_CTRL to ADC2_Init()                **
** V0.2.1: 2020-04-15, BG:   Updated revision history format                  **
** V0.2.2: 2020-07-13, JO:   EP-431: remove ARMCC v6 Compiler warnings        **
**                           - Added typecasts to remove 'implicit typecast'  **
**                             warning                                        **
** V0.2.3: 2020-07-21, BG:   EP-439: Formatted .h/.c files                    **
** V0.2.4: 2020-10-13, JO:   EP-518: Replaced ° by deg in doxygen comment     **
** V0.2.5: 2021-04-23, BG:   EP-726: Corrected MISRA 2012 violations          **
** V0.2.6: 2022-02-28, JO:   EP-936: Updated copyright and branding           **
** V0.2.7: 2025-01-02, JO:   EP-1493: Updated license                         **
*******************************************************************************/

#ifndef ADC2_H
#define ADC2_H

/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/
#include "tle987x.h"
#include "types.h"
#include "adc2_defines.h"
#include "tle_variants.h"
#include "sfr_access.h"

/*******************************************************************************
**                        Global Constant Declarations                        **
*******************************************************************************/
/**\brief ADC2 \f$ V_{BG}\f$ in Volts */
#define ADC2_VREF (1.211F)
/**\brief ADC2 \f$ V_{BG}\f$ (1.211 V) in millivolts */
#define ADC2_VREF_mV (1211)
/**\brief ADC2 Filtered output register maximum value */
#define ADC2_FILTOUT_MAX (1023u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for VS:
    attenuator for VS Range 0..28V is 0.039 => Inverse fraction (1000/39) */
#define VS_ATTEN_CONV_NOMIN_MAX28V  (1000u)
#define VS_ATTEN_CONV_DENOM_MAX28V  (39u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for VS:
    attenuator for VS Range 0..22V is 0.055 => Inverse fraction (200/11) */
#define VS_ATTEN_CONV_NOMIN_MAX22V  (200u)
#define VS_ATTEN_CONV_DENOM_MAX22V  (11u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for VSD:
    attenuator for VSD is 0.039 => Inverse fraction (1000/39) */
#define VSD_ATTEN_CONV_NOMIN    (1000u)
#define VSD_ATTEN_CONV_DENOM    (39u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for VCP:
    attenuator for VCP is 0.023 => Inverse fraction (1000/23) */
#define VCP_ATTEN_CONV_NOMIN    (1000u)
#define VCP_ATTEN_CONV_DENOM    (23u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for MON:
    attenuator for MON is 0.039 => Inverse fraction (1000/39) */
#define MON_ATTEN_CONV_NOMIN    (1000u)
#define MON_ATTEN_CONV_DENOM    (39u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for VDDP:
    attenuator for VDDP is 0.164 => Inverse fraction (250/41) */
#define VDDP_ATTEN_CONV_NOMIN   (250u)
#define VDDP_ATTEN_CONV_DENOM   (41u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for VAREF:
    attenuator for VAREF is 0.219 => Inverse fraction (1000/219) */
#define VAREF_ATTEN_CONV_NOMIN  (1000u)
#define VAREF_ATTEN_CONV_DENOM  (219u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for VBG:
    attenuator for VBG is 0.75 => Inverse fraction (4/3) */
#define VBG_ATTEN_CONV_NOMIN    (4u)
#define VBG_ATTEN_CONV_DENOM    (3u)

/**\brief Nominator and Denominator of Attenuator Conversion formula for VDDC:
    attenuator for VDDC is 0.75 => Inverse fraction (4/3) */
#define VDDC_ATTEN_CONV_NOMIN   (4u)
#define VDDC_ATTEN_CONV_DENOM   (3u)

/**\brief Offset of V_Temp (mV) corresponding to 0 &deg;C reference */
#define V_TEMP_REF_OFFSET_mV    (666u)

/**\brief Scaling factor for V_Temp (mV) */
#define V_TEMP_SCALE_FACT   (100u)

