valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9871QXA20/adc2.h
/**\brief Conversion coefficient from V_Temp (mV) to Temperature (&deg;C)
   multiplied by V_TEMP_SCALE_FACT */
#define CONV_COEFF_mV_TO_degC    (231u)

/**\brief ADC2 channel selection macro, channel 0 - VBAT */
#define ADC2_VBAT       (0)
/**\brief ADC2 channel selection macro, channel 1 - VS */
#define ADC2_VS         (1)
/**\brief ADC2 channel selection macro, channel 2 - VSD */
#define ADC2_VSD        (2)
/**\brief ADC2 channel selection macro, channel 3 - VCP */
#define ADC2_VCP        (3)
/**\brief ADC2 channel selection macro, channel 4 - MON */
#define ADC2_MON        (4)
/**\brief ADC2 channel selection macro, channel 5 - VDDP */
#define ADC2_VDDP       (5)
/**\brief ADC2 channel selection macro, channel 6 - VAREF */
#define ADC2_VAREF      (6)
/**\brief ADC2 channel selection macro, channel 7 - VBG */
#define ADC2_VBG        (7)
/**\brief ADC2 channel selection macro, channel 8 - VDDC */
#define ADC2_VDDC       (8)
/**\brief ADC2 channel selection macro, channel 9 - TEMP */
#define ADC2_TEMP       (9)

/*******************************************************************************
**                          Global Macro Declarations                         **
*******************************************************************************/

#if (UC_SERIES == TLE986)
#define ADC2_VBat_Attenuator_Range_3_28V (1u)
#define ADC2_VBat_Attenuator_Range_3_22V (0u)

/** \brief sets ADC2 Channel 0 (VBat) Attenuator Range to Range 2 (from 3 to 28 V).
 *
 * \brief <b>Example</b><br>
 * \brief This example sets ADC2 Channel 0 (VBat) Attenuator Range to Range 2 (from 3 to 28 V).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBat_Attenuator_Range_3_28V_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBat_Attenuator_Range_3_28V_Set(void)
{
  Field_Mod32(&ADC2->CTRL_STS.reg, ADC2_CTRL_STS_VBAT_RANGE_Pos, ADC2_CTRL_STS_VBAT_RANGE_Msk, 1u);
}

/** \brief sets ADC2 Channel 0 (VBat) Attenuator Range to Range 1 (from 3 to 22 V).
 *
 * \brief <b>Example</b><br>
 * \brief This example sets ADC2 Channel 0 (VBat) Attenuator Range to Range 1 (from 3 to 22 V).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBat_Attenuator_Range_3_22V_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBat_Attenuator_Range_3_22V_Set(void)
{
  Field_Mod32(&ADC2->CTRL_STS.reg, ADC2_CTRL_STS_VBAT_RANGE_Pos, ADC2_CTRL_STS_VBAT_RANGE_Msk, 0u);
}

/** \brief gets ADC2 Channel 0 (VBat) Attenuator Range.
 *
 * \retval 1 if Range 2 (from 3 to 22V) is selected.
 * \retval 0 if Range 1 (from 3 to 28V) is selected.
 *
 * \brief <b>Example</b><br>
 * \brief This example reads ADC2 Channel 0 (VBat) Attenuator Range.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   uint8 data;
 *
 *   data = ADC2_VBat_Attenuator_Range_Get();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint8 ADC2_VBat_Attenuator_Range_Get(void)
{
  return ( u8_Field_Rd32(&ADC2->CTRL_STS.reg, ADC2_CTRL_STS_VBAT_RANGE_Pos, ADC2_CTRL_STS_VBAT_RANGE_Msk) );
}
#endif

#define ADC2_VS_Attenuator_Range_3_28V (1u)
#define ADC2_VS_Attenuator_Range_3_22V (0u)

/** \brief sets ADC2 Channel 1 (VS) Attenuator Range to Range 2 (from 3 to 28 V).
 *
 * \brief <b>Example</b><br>
 * \brief This example sets ADC2 Channel 1 (VS) Attenuator Range to Range 2 (from 3 to 28 V).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VS_Attenuator_Range_3_28V_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VS_Attenuator_Range_3_28V_Set(void)
{
  Field_Mod32(&ADC2->CTRL_STS.reg, ADC2_CTRL_STS_VS_RANGE_Pos, ADC2_CTRL_STS_VS_RANGE_Msk, 1u);
}

/** \brief sets ADC2 Channel 1 (VS) Attenuator Range to Range 1 (from 3 to 22 V).
 *
 * \brief <b>Example</b><br>
 * \brief This example sets ADC2 Channel 1 (VS) Attenuator Range to Range 1 (from 3 to 22 V).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VS_Attenuator_Range_3_22V_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VS_Attenuator_Range_3_22V_Set(void)
{
  Field_Mod32(&ADC2->CTRL_STS.reg, ADC2_CTRL_STS_VS_RANGE_Pos, ADC2_CTRL_STS_VS_RANGE_Msk, 0u);
}

/** \brief gets ADC2 Channel 1 (VS) Attenuator Range.
 *
 * \retval 1 if Range 2 (from 3 to 22V) is selected.
 * \retval 0 if Range 1 (from 3 to 28V) is selected.
 *
 * \brief <b>Example</b><br>
 * \brief This example reads ADC2 Channel 1 (VS) Attenuator Range.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   uint8 data;
 *
 *   data = ADC2_VS_Attenuator_Range_Get();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint8 ADC2_VS_Attenuator_Range_Get(void)
{
  return ( u8_Field_Rd32(&ADC2->CTRL_STS.reg, ADC2_CTRL_STS_VS_RANGE_Pos, ADC2_CTRL_STS_VS_RANGE_Msk) );
}

/* ADC2 Interrupt Clear Macros */
/** \brief clears VS Overvoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VS Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VS_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VS_OV_IS == 1u)
 *   {
 *     ADC2_VS_UP_CALLBACK();
 *     ADC2_VS_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VS_OV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_VS_OV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_VS_OV_ICLR_Msk, 1u);
}

/** \brief clears VS Undervoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VS Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VS_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VS_UV_IS == 1u)
 *   {
 *     ADC2_VS_LO_CALLBACK();
 *     ADC2_VS_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VS_UV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_VS_UV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_VS_UV_ICLR_Msk, 1u);
}

/** \brief clears VDDP Overvoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VDDP Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VDDP_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VDD5V_OV_IS == 1u)
 *   {
 *     ADC2_VDDP_UP_CALLBACK();
 *     ADC2_VDDP_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VDDP_OV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_OV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_OV_ICLR_Msk, 1u);
}

/** \brief clears VDDP Undervoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VDDP Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VDDP_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VDD5V_UV_IS == 1u)
 *   {
 *     ADC2_VDDP_LO_CALLBACK();
 *     ADC2_VDDP_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VDDP_UV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_UV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_VDD5V_UV_ICLR_Msk, 1u);
}

/** \brief clears VDDC Overvoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VDDC Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VDDC_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VDD1V5_OV_IS == 1u)
 *   {
 *     ADC2_VDDC_UP_CALLBACK();
 *     ADC2_VDDC_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VDDC_OV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_OV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_OV_ICLR_Msk, 1u);
}

