valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9871QXA20/adc2.h
/** \brief clears VDDC Undervoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VDDC Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VDDC_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VDD1V5_UV_IS == 1u)
 *   {
 *     ADC2_VDDC_LO_CALLBACK();
 *     ADC2_VDDC_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VDDC_UV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_UV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_VDD1V5_UV_ICLR_Msk, 1u);
}

/** \brief clears Driver Supply MU High Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Driver Supply MU High interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VSD_OV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VSD_UPTH_IS == 1u)
 *   {
 *     ADC2_VSD_UP_CALLBACK();
 *     ADC2_VSD_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VSD_OV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->BDRV_ISCLR.reg, SCUPM_BDRV_ISCLR_VSD_UPTH_ICLR_Pos, SCUPM_BDRV_ISCLR_VSD_UPTH_ICLR_Msk, 1u);
}

/** \brief clears Driver Supply MU Low interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Driver Supply MU Low interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VSD_UV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VSD_LOWTH_IS == 1u)
 *   {
 *     ADC2_VSD_LO_CALLBACK();
 *     ADC2_VSD_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VSD_UV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->BDRV_ISCLR.reg, SCUPM_BDRV_ISCLR_VSD_LOWTH_ICLR_Pos, SCUPM_BDRV_ISCLR_VSD_LOWTH_ICLR_Msk, 1u);
}

/** \brief clears Charge Pump MU High Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Charge Pump MU High interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VCP_OV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VCP_UPTH_IS == 1u)
 *   {
 *     ADC2_VCP_UP_CALLBACK();
 *     ADC2_VCP_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VCP_OV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->BDRV_ISCLR.reg, SCUPM_BDRV_ISCLR_VCP_UPTH_ICLR_Pos, SCUPM_BDRV_ISCLR_VCP_UPTH_ICLR_Msk, 1u);
}

/** \brief clears Charge Pump MU Low Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Charge Pump MU Low interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VCP_UV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VCP_LOWTH1_IS == 1u)
 *   {
 *     ADC2_VCP_LO_CALLBACK();
 *     ADC2_VCP_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VCP_UV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->BDRV_ISCLR.reg, SCUPM_BDRV_ISCLR_VCP_LOWTH1_ICLR_Pos, SCUPM_BDRV_ISCLR_VCP_LOWTH1_ICLR_Msk, 1u);
}

#if (UC_SERIES == TLE986)
/** \brief clears VBAT Overvoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VBAT Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBAT_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VBAT_OV_IS == 1u)
 *   {
 *     ADC2_VBAT_UP_CALLBACK();
 *     ADC2_VBAT_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBAT_OV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_OV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_OV_ICLR_Msk, 1u);
}

/** \brief clears VBAT Undervoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VBAT Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBAT_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VBAT_UV_IS == 1u)
 *   {
 *     ADC2_VBAT_LO_CALLBACK();
 *     ADC2_VBAT_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBAT_UV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_UV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_VBAT_UV_ICLR_Msk, 1u);
}
#endif

#if (UC_SERIES == TLE987)
/** \brief clears MON Overvoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_MON_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.MON_OV_IS == 1u)
 *   {
 *     ADC2_MON_UP_CALLBACK();
 *     ADC2_MON_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_MON_OV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_MON_OV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_MON_OV_ICLR_Msk, 1u);
}

/** \brief clears MON Undervoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_MON_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.MON_UV_IS == 1u)
 *   {
 *     ADC2_MON_LO_CALLBACK();
 *     ADC2_MON_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_MON_UV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_SUPPLY_IRQ_CLR.reg, SCUPM_SYS_SUPPLY_IRQ_CLR_MON_UV_ICLR_Pos, SCUPM_SYS_SUPPLY_IRQ_CLR_MON_UV_ICLR_Msk, 1u);
}
#endif

/** \brief clears 8 Bit ADC2 Reference Overvoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the 8 Bit ADC2 Reference Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBG_OV_Int_En();
 *   if (MF->REF1_STS.bit.REFBG_UPTHWARN_STS == 1u)
 *   {
 *     ADC2_VBG_UP_CALLBACK();
 *     ADC2_VBG_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBG_OV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_ISCLR.reg, SCUPM_SYS_ISCLR_REFBG_UPTHWARN_ICLR_Pos, SCUPM_SYS_ISCLR_REFBG_UPTHWARN_ICLR_Msk, 1u);
}

/** \brief clears 8 Bit ADC2 Reference Undervoltage Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the 8 Bit ADC2 Reference Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBG_UV_Int_En();
 *   if (MF->REF1_STS.bit.REFBG_LOTHWARN_STS == 1u)
 *   {
 *     ADC2_VBG_LO_CALLBACK();
 *     ADC2_VBG_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBG_UV_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_ISCLR.reg, SCUPM_SYS_ISCLR_REFBG_LOTHWARN_ICLR_Pos, SCUPM_SYS_ISCLR_REFBG_LOTHWARN_ICLR_Msk, 1u);
}

#if ((ADC2_CTRL2 & (1u << 2u)) == 0u)
/* System Temperature Sensor */
/** \brief clears System Overtemperature Shutdown Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Shutdown interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_OT_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OT_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_UP_CALLBACK();
 *     ADC2_TEMP_OT_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_TEMP_OT_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_ISCLR.reg, SCUPM_SYS_ISCLR_SYS_OT_ICLR_Pos, SCUPM_SYS_ISCLR_SYS_OT_ICLR_Msk, 1u);
}

/** \brief clears System Overtemperature Prewarning Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Prewarning interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_WARN_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OTWARN_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_LO_CALLBACK();
 *     ADC2_TEMP_WARN_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_TEMP_WARN_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_ISCLR.reg, SCUPM_SYS_ISCLR_SYS_OTWARN_ICLR_Pos, SCUPM_SYS_ISCLR_SYS_OTWARN_ICLR_Msk, 1u);
}
#else
/* PMU Temperature Sensor */
/** \brief clears System Overtemperature Shutdown Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Shutdown interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_OT_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OT_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_UP_CALLBACK();
 *     ADC2_TEMP_OT_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_TEMP_OT_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_ISCLR.reg, SCUPM_SYS_ISCLR_PMU_OT_ICLR_Pos, SCUPM_SYS_ISCLR_PMU_OT_ICLR_Msk, 1u);
}

/** \brief clears System Overtemperature Prewarning Interrupt Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Prewarning interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_WARN_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OTWARN_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_LO_CALLBACK();
 *     ADC2_TEMP_WARN_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_TEMP_WARN_Int_Clr(void)
{
  Field_Wrt32(&SCUPM->SYS_ISCLR.reg, SCUPM_SYS_ISCLR_PMU_OTWARN_ICLR_Pos, SCUPM_SYS_ISCLR_PMU_OTWARN_ICLR_Msk, 1u);
}
#endif

