valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9871QXA20/adc2.h
/** \brief disables VDDC Undervoltage interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VDDC Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VDDC_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VDD1V5_UV_IS == 1u)
 *   {
 *     ADC2_VDDC_LO_CALLBACK();
 *     ADC2_VDDC_UV_Int_Clr();
 *   }
 *   ADC2_VDDC_UV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VDDC_UV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_VDD1V5_UV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_VDD1V5_UV_IE_Msk, 0u);
}

/** \brief enables Driver Supply MU High interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Driver Supply MU High interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VSD_OV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VSD_UPTH_IS == 1u)
 *   {
 *     ADC2_VSD_UP_CALLBACK();
 *     ADC2_VSD_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VSD_OV_Int_En(void)
{
  Field_Mod32(&SCUPM->BDRV_IRQ_CTRL.reg, SCUPM_BDRV_IRQ_CTRL_VSD_UPTH_IE_Pos, SCUPM_BDRV_IRQ_CTRL_VSD_UPTH_IE_Msk, 1u);
}

/** \brief disables Driver Supply MU High interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Driver Supply MU High interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VSD_OV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VSD_UPTH_IS == 1u)
 *   {
 *     ADC2_VSD_UP_CALLBACK();
 *     ADC2_VSD_OV_Int_Clr();
 *   }
 *   ADC2_VSD_OV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VSD_OV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->BDRV_IRQ_CTRL.reg, SCUPM_BDRV_IRQ_CTRL_VSD_UPTH_IE_Pos, SCUPM_BDRV_IRQ_CTRL_VSD_UPTH_IE_Msk, 0u);
}

/** \brief enables Driver Supply MU Low interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Driver Supply MU Low interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VSD_UV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VSD_LOWTH_IS == 1u)
 *   {
 *     ADC2_VSD_LO_CALLBACK();
 *     ADC2_VSD_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VSD_UV_Int_En(void)
{
  Field_Mod32(&SCUPM->BDRV_IRQ_CTRL.reg, SCUPM_BDRV_IRQ_CTRL_VSD_LOWTH_IE_Pos, SCUPM_BDRV_IRQ_CTRL_VSD_LOWTH_IE_Msk, 1u);
}

/** \brief disables Driver Supply MU Low interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Driver Supply MU Low interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VSD_UV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VSD_LOWTH_IS == 1u)
 *   {
 *     ADC2_VSD_LO_CALLBACK();
 *     ADC2_VSD_UV_Int_Clr();
 *   }
 *   ADC2_VSD_UV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VSD_UV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->BDRV_IRQ_CTRL.reg, SCUPM_BDRV_IRQ_CTRL_VSD_LOWTH_IE_Pos, SCUPM_BDRV_IRQ_CTRL_VSD_LOWTH_IE_Msk, 0u);
}

/** \brief enables Charge Pump MU High interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Charge Pump MU High interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VCP_OV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VCP_UPTH_IS == 1u)
 *   {
 *     ADC2_VCP_UP_CALLBACK();
 *     ADC2_VCP_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VCP_OV_Int_En(void)
{
  Field_Mod32(&SCUPM->BDRV_IRQ_CTRL.reg, SCUPM_BDRV_IRQ_CTRL_VCP_UPTH_IE_Pos, SCUPM_BDRV_IRQ_CTRL_VCP_UPTH_IE_Msk, 1u);
}

/** \brief disables Charge Pump MU High interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Charge Pump MU High interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VCP_OV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VCP_UPTH_IS == 1u)
 *   {
 *     ADC2_VCP_UP_CALLBACK();
 *     ADC2_VCP_OV_Int_Clr();
 *   }
 *   ADC2_VCP_OV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VCP_OV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->BDRV_IRQ_CTRL.reg, SCUPM_BDRV_IRQ_CTRL_VCP_UPTH_IE_Pos, SCUPM_BDRV_IRQ_CTRL_VCP_UPTH_IE_Msk, 0u);
}

/** \brief enables Charge Pump MU Low interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Charge Pump MU Low interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VCP_UV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VCP_LOWTH1_IS == 1u)
 *   {
 *     ADC2_VCP_LO_CALLBACK();
 *     ADC2_VCP_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VCP_UV_Int_En(void)
{
  Field_Mod32(&SCUPM->BDRV_IRQ_CTRL.reg, SCUPM_BDRV_IRQ_CTRL_VCP_LOWTH1_IE_Pos, SCUPM_BDRV_IRQ_CTRL_VCP_LOWTH1_IE_Msk, 1u);
}

/** \brief disables Charge Pump MU Low interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the Charge Pump MU Low interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VCP_UV_Int_En();
 *   if (SCUPM->BDRV_IS.bit.VCP_LOWTH1_IS == 1u)
 *   {
 *     ADC2_VCP_LO_CALLBACK();
 *     ADC2_VCP_UV_Int_Clr();
 *   }
 *   ADC2_VCP_UV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VCP_UV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->BDRV_IRQ_CTRL.reg, SCUPM_BDRV_IRQ_CTRL_VCP_LOWTH1_IE_Pos, SCUPM_BDRV_IRQ_CTRL_VCP_LOWTH1_IE_Msk, 0u);
}

#if (UC_SERIES == TLE986)
/** \brief enables VBAT Overvoltage Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VBAT Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBAT_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VBAT_OV_IS == 1u)
 *   {
 *     ADC2_VBAT_UP_CALLBACK();
 *     ADC2_VBAT_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBAT_OV_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_OV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_OV_IE_Msk, 1u);
}

/** \brief disables VBAT Overvoltage Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VBAT Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBAT_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VBAT_OV_IS == (uint8)1u)
 *   {
 *     ADC2_VBAT_UP_CALLBACK();
 *     ADC2_VBAT_OV_Int_Clr();
 *   }
 *   ADC2_VBAT_OV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBAT_OV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_OV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_OV_IE_Msk, 0u);
}

/** \brief enables VBAT Undervoltage Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VBAT Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBAT_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VBAT_UV_IS == 1u)
 *   {
 *     ADC2_VBAT_LO_CALLBACK();
 *     ADC2_VBAT_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBAT_UV_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_UV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_UV_IE_Msk, 1u);
}

