valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9871QXA20/adc2.h
/** \brief disables VBAT Undervoltage Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the VBAT Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBAT_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.VBAT_UV_IS == (uint8)1u)
 *   {
 *     ADC2_VBAT_LO_CALLBACK();
 *     ADC2_VBAT_UV_Int_Clr();
 *   }
 *   ADC2_VBAT_UV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBAT_UV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_UV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_VBAT_UV_IE_Msk, 0u);
}
#endif

#if (UC_SERIES == TLE987)
/** \brief enables MON Overvoltage Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_MON_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.MON_OV_IS == 1u)
 *   {
 *     ADC2_MON_UP_CALLBACK();
 *     ADC2_MON_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_MON_OV_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_MON_OV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_MON_OV_IE_Msk, 1u);
}

/** \brief disables MON Overvoltage Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_MON_OV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.MON_OV_IS == 1u)
 *   {
 *     ADC2_MON_UP_CALLBACK();
 *     ADC2_MON_OV_Int_Clr();
 *   }
 *   ADC2_MON_OV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_MON_OV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_MON_OV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_MON_OV_IE_Msk, 0u);
}

/** \brief enables MON Undervoltage Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_MON_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.MON_UV_IS == 1u)
 *   {
 *     ADC2_MON_OL_CALLBACK();
 *     ADC2_MON_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_MON_UV_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_MON_UV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_MON_UV_IE_Msk, 1u);
}

/** \brief disables MON Undervoltage Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_MON_UV_Int_En();
 *   if (SCUPM->SYS_SUPPLY_IRQ_STS.bit.MON_UV_IS == 1u)
 *   {
 *     ADC2_MON_OL_CALLBACK();
 *     ADC2_MON_UV_Int_Clr();
 *   }
 *   ADC2_MON_UV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_MON_UV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_SUPPLY_IRQ_CTRL.reg, SCUPM_SYS_SUPPLY_IRQ_CTRL_MON_UV_IE_Pos, SCUPM_SYS_SUPPLY_IRQ_CTRL_MON_UV_IE_Msk, 0u);
}
#endif

/** \brief enables 8 Bit ADC2 Reference Overvoltage interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the 8 Bit ADC2 Reference Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBG_OV_Int_En();
 *   if (MF->REF1_STS.bit.REFBG_UPTHWARN_STS == 1u)
 *   {
 *     ADC2_VBG_UP_CALLBACK();
 *     ADC2_VBG_OV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBG_OV_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_REFBG_UPTHWARN_IE_Pos, SCUPM_SYS_IRQ_CTRL_REFBG_UPTHWARN_IE_Msk, 1u);
}

/** \brief disables 8 Bit ADC2 Reference Overvoltage interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the 8 Bit ADC2 Reference Overvoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBG_OV_Int_En();
 *   if (MF->REF1_STS.bit.REFBG_UPTHWARN_STS == 1u)
 *   {
 *     ADC2_VBG_UP_CALLBACK();
 *     ADC2_VBG_OV_Int_Clr();
 *   }
 *   ADC2_VBG_OV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBG_OV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_REFBG_UPTHWARN_IE_Pos, SCUPM_SYS_IRQ_CTRL_REFBG_UPTHWARN_IE_Msk, 0u);
}

/** \brief enables 8 Bit ADC2 Reference Undervoltage interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the 8 Bit ADC2 Reference Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBG_UV_Int_En();
 *   if (MF->REF1_STS.bit.REFBG_LOTHWARN_STS == 1u)
 *   {
 *     ADC2_VBG_LO_CALLBACK();
 *     ADC2_VBG_UV_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBG_UV_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_REFBG_LOTHWARN_IE_Pos, SCUPM_SYS_IRQ_CTRL_REFBG_LOTHWARN_IE_Msk, 1u);
}

/** \brief disables 8 Bit ADC2 Reference Undervoltage interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the 8 Bit ADC2 Reference Undervoltage interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_VBG_UV_Int_En();
 *   if (MF->REF1_STS.bit.REFBG_LOTHWARN_STS == 1u)
 *   {
 *     ADC2_VBG_LO_CALLBACK();
 *     ADC2_VBG_UV_Int_Clr();
 *   }
 *   ADC2_VBG_UV_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_VBG_UV_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_REFBG_LOTHWARN_IE_Pos, SCUPM_SYS_IRQ_CTRL_REFBG_LOTHWARN_IE_Msk, 0u);
}

#if ((ADC2_CTRL2 & (1u << 2u)) == 0u)
/* System Temperature Sensor */
/** \brief enables System Overtemperature Shutdown interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Shutdown interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_OT_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OT_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_UP_CALLBACK();
 *     ADC2_TEMP_OT_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_Temp_OT_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_SYS_OT_IE_Pos, SCUPM_SYS_IRQ_CTRL_SYS_OT_IE_Msk, 1u);
}

/** \brief disables System Overtemperature Shutdown interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Shutdown interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_OT_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OT_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_UP_CALLBACK();
 *     ADC2_TEMP_OT_Int_Clr();
 *   }
 *   ADC2_TEMP_OT_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_Temp_OT_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_SYS_OT_IE_Pos, SCUPM_SYS_IRQ_CTRL_SYS_OT_IE_Msk, 0u);
}

/** \brief enables System Overtemperature Prewarning interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Prewarning interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_WARN_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OTWARN_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_LO_CALLBACK();
 *     ADC2_TEMP_WARN_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_Temp_Warn_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_SYS_OTWARN_IE_Pos, SCUPM_SYS_IRQ_CTRL_SYS_OTWARN_IE_Msk, 1u);
}

/** \brief disables System Overtemperature Prewarning interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Prewarning interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_WARN_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OTWARN_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_LO_CALLBACK();
 *     ADC2_TEMP_WARN_Int_Clr();
 *   }
 *   ADC2_TEMP_WARN_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_Temp_Warn_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_SYS_OTWARN_IE_Pos, SCUPM_SYS_IRQ_CTRL_SYS_OTWARN_IE_Msk, 0u);
}
#else
/* PMU Temperature Sensor */
/** \brief enables System Overtemperature Shutdown interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Shutdown interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_OT_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OT_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_UP_CALLBACK();
 *     ADC2_TEMP_OT_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_Temp_OT_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_PMU_OT_IE_Pos, SCUPM_SYS_IRQ_CTRL_PMU_OT_IE_Msk, 1u);
}

/** \brief disables System Overtemperature Shutdown interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Shutdown interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_OT_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OT_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_UP_CALLBACK();
 *     ADC2_TEMP_OT_Int_Clr();
 *   }
 *   ADC2_TEMP_OT_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_Temp_OT_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_PMU_OT_IE_Pos, SCUPM_SYS_IRQ_CTRL_PMU_OT_IE_Msk, 0u);
}

/** \brief enables System Overtemperature Prewarning interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Prewarning interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_WARN_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OTWARN_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_LO_CALLBACK();
 *     ADC2_TEMP_WARN_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_Temp_Warn_Int_En(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_PMU_OTWARN_IE_Pos, SCUPM_SYS_IRQ_CTRL_PMU_OTWARN_IE_Msk, 1u);
}

/** \brief disables System Overtemperature Prewarning interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the System Overtemperature Prewarning interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   ADC2_TEMP_WARN_Int_En();
 *   if (SCUPM->SYS_IS.bit.SYS_OTWARN_IS == 1u)
 *   {
 *     ADC2_SYS_TEMP_LO_CALLBACK();
 *     ADC2_TEMP_WARN_Int_Clr();
 *   }
 *   ADC2_TEMP_WARN_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE void ADC2_Temp_Warn_Int_Dis(void)
{
  Field_Mod32(&SCUPM->SYS_IRQ_CTRL.reg, SCUPM_SYS_IRQ_CTRL_PMU_OTWARN_IE_Pos, SCUPM_SYS_IRQ_CTRL_PMU_OTWARN_IE_Msk, 0u);
}
#endif

