valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9871QXA20/adc2.h
/*******************************************************************************
**                        Global Function Declarations                        **
*******************************************************************************/
/** \brief Initializes the ADC2 module based on the Config Wizard for MOTIX MCU configuration
 *
 * \ingroup adc2_api
 */
void ADC2_Init(void);
INLINE uint16 ADC2_GetChResult(uint8 channel);
#if (UC_SERIES == TLE986)
  INLINE uint16 ADC2_VBat_Result_mV(void);
#endif
INLINE uint16 ADC2_VS_Result_mV(void);
INLINE uint16 ADC2_VSD_Result_mV(void);
INLINE uint16 ADC2_VCP_Result_mV(void);
INLINE uint16 ADC2_MON_Result_mV(void);
INLINE uint16 ADC2_VAREF_Result_mV(void);
INLINE uint16 ADC2_VDDP_Result_mV(void);
INLINE uint16 ADC2_VBG_Result_mV(void);
INLINE uint16 ADC2_VDDC_Result_mV(void);
INLINE sint16 ADC2_Temp_Result_C(void);

/*******************************************************************************
**                     Global Inline Function Definitions                     **
*******************************************************************************/
/** \brief Returns the 10 bit wide result of the selected ADC2 channel
 * \brief Returns 0 if the selected channel number is greater than 9
 *
 * \param channel selected ADC2 channel number (0 to 9)
 * \return 10 bit wide result of the selected channel (FILT_OUT0 to FILT_OUT9)
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the ADC2 Channel 4 result value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_GetChResult(0x4);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_GetChResult(uint8 channel)
{
  const volatile uint32 *pBaseAddr;
  uint16 Var;
  uint32 addr;
  uint16 idx;

  if ((uint8)ADC2_TEMP >= channel)
  {
    /* violation: intended cast from pointer to unsigned int [MISRA Rule 45]*/
    addr = (uint32)&ADC2->FILT_OUT0.reg;
    /* calculate address offset corresponding to the input channel number */
    idx = (uint16)((uint16)channel << 2u);
    addr += idx;
    /* violation: intended cast from unsigned int to pointer [MISRA Rule 45]*/
    pBaseAddr = (volatile uint32 *) addr;
    /* read the 10 LSbit of the ADC FILT_OUTx register */
    Var = (uint16)((*pBaseAddr) & (uint32)0x000003FF);
  }
  else
  {
    Var = 0;
  }

  return (Var);
} /* End of ADC2_GetChResult */
#if (UC_SERIES == TLE986)
/** \brief returns the Voltage of the VBAT line (ADC2 Channel 0 in TLE986x) in millivolt (mV)
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n If the VS range is up to 28 V, then
 * \brief \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{1000}{39}\f$
 * \brief \n \n If the VS range is up to 22 V, then
 * \brief \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{200}{11}\f$
 *
 * \return Voltage of the VBAT line (ADC2 Channel 0) in millivolt
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_VBat_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_VBat_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult(ADC2_VBAT);

  if (ADC2_VBat_Attenuator_Range_Get() == ADC2_VS_Attenuator_Range_3_28V)
  {
    /* Conversion for VBat attenuator range up to 28 V same as for VS */
    value = (uint16)(((value * ((uint32)ADC2_VREF_mV * (uint16)VS_ATTEN_CONV_NOMIN_MAX28V)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VS_ATTEN_CONV_DENOM_MAX28V);
  }
  else
  {
    /* Conversion for VBat attenuator range up to 22 V same as for VS */
    value = (uint16)(((value * ((uint32)ADC2_VREF_mV * (uint16)VS_ATTEN_CONV_NOMIN_MAX22V)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VS_ATTEN_CONV_DENOM_MAX22V);
  }

  return (value);
}
#endif
/** \brief returns the Voltage of the VS line (ADC2 Channel 1) in millivolt (mV)
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n If the VS range is up to 28 V, then
 * \brief \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{1000}{39}\f$
 * \brief \n \n If the VS range is up to 22 V, then
 * \brief \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{200}{11}\f$
 *
 * \return Voltage of the VS line (ADC2 Channel 1) in millivolt
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_VS_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_VS_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult(ADC2_VS);

  if (ADC2_VS_Attenuator_Range_Get() == ADC2_VS_Attenuator_Range_3_28V)
  {
    /* Conversion for VS attenuator range up to 28 V */
    value = (uint16)(((value * (uint32)((uint16)ADC2_VREF_mV * (uint16)VS_ATTEN_CONV_NOMIN_MAX28V)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VS_ATTEN_CONV_DENOM_MAX28V);
  }
  else
  {
    /* Conversion for VS attenuator range up to 22 V */
    value = (uint16)(((value * (uint32)((uint16)ADC2_VREF_mV * (uint16)VS_ATTEN_CONV_NOMIN_MAX22V)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VS_ATTEN_CONV_DENOM_MAX22V);
  }

  return (value);
}
/** \brief returns the Voltage of the VSD line (ADC2 Channel 2) in millivolt
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{1000}{39}\f$
 *
 * \return Voltage of the VSD line (ADC2 Channel 2) in millivolt
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value./
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_VSD_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_VSD_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult(ADC2_VSD);
  /* Conversion for VSD attenuator (attenuator 0.039 = 39/1000) */
  value = (uint16)(((value * (uint32)((uint16)ADC2_VREF_mV * (uint16)VSD_ATTEN_CONV_NOMIN)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VSD_ATTEN_CONV_DENOM);
  return (value);
}
/** \brief returns the Voltage of the VCP line (ADC2 Channel 3) in millivolt (mV)
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{1000}{23}\f$
 *
 * \return Voltage of the VCP line (ADC2 Channel 3) in millivolt (mV)
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value./
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_VCP_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_VCP_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult((uint8)ADC2_VCP);
  /* Conversion for VCP attenuator (attenuator 0.023 = 23/1000) */
  value = (uint16)(((value * ((uint32)ADC2_VREF_mV * (uint16)VCP_ATTEN_CONV_NOMIN)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VCP_ATTEN_CONV_DENOM);
  return (value);
}

/** \brief returns the Voltage of the MON line (ADC2 Channel 4) in millivolt (mV)
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{1000}{39}\f$
 *
 * \return Voltage of the MON line (ADC2 Channel 4) in millivolt (mV)
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value./
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_MON_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_MON_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult((uint8)ADC2_MON);
  /* Conversion for MON attenuator (attenuator 0.039 = 39/1000) */
  value = (uint16)(((value * ((uint32)ADC2_VREF_mV * (uint16)MON_ATTEN_CONV_NOMIN)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)MON_ATTEN_CONV_DENOM);
  return (value);
}

