valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9871QXA20/adc2.h
/** \brief returns the Voltage of the VDDP line (ADC2 Channel 5) in millivolt (mV)
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{250}{41}\f$
 *
 * \return Voltage of the VDDP line (ADC2 Channel 5) in millivolt (mV)
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value./
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_VDDP_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_VDDP_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult((uint8)ADC2_VDDP);
  /* Conversion for VDDP attenuator (attenuator 0.164 = 41/250) */
  value = (uint16)(((value * ((uint32)ADC2_VREF_mV * (uint16)VDDP_ATTEN_CONV_NOMIN)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VDDP_ATTEN_CONV_DENOM);
  return (value);
}

/** \brief returns the Voltage of the VAREF line (ADC2 Channel 6) in millivolt (mV)
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{1000}{219}\f$
 *
 * \return Voltage of the VAREF line (ADC2 Channel 6) in millivolt (mV)
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value./
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_VAREF_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_VAREF_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult((uint8)ADC2_VAREF);
  /* Conversion for VAREF attenuator (attenuator 0.219 = 219/1000) */
  value = (uint16)(((value * ((uint32)ADC2_VREF_mV * (uint16)VAREF_ATTEN_CONV_NOMIN)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VAREF_ATTEN_CONV_DENOM);
  return (value);
}

/** \brief returns the Voltage of the VBG line (ADC2 Channel 7) in millivolt (mV)
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{4}{3}\f$
 *
 * \return Voltage of the VBG line (ADC2 Channel 7) in millivolt (mV)
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value./
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_VBG_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_VBG_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult((uint8)ADC2_VBG);
  /* Conversion for VBG attenuator (attenuator 0.75 = 3/4) */
  value = (uint16)(((value * ((uint32)ADC2_VREF_mV * (uint16)VBG_ATTEN_CONV_NOMIN)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VBG_ATTEN_CONV_DENOM);
  return (value);
}

/** \brief returns the Voltage of the VDDC line (ADC2 Channel 8) in millivolt (mV)
 * \brief calculated based on attenuator conversion factor as follows:
 * \brief \n \n \f$ Voltage(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}*\frac{4}{3}\f$
 *
 * \return Voltage of the VDDC line (ADC2 Channel 8) in millivolt (mV)
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value./
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint16 data;
 *
 *     data = ADC2_VDDC_Result_mV();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE uint16 ADC2_VDDC_Result_mV(void)
{
  uint16 value;
  value = ADC2_GetChResult((uint8)ADC2_VDDC);
  /* Conversion for VDDC attenuator (attenuator 0.75 = 3/4) */
  value = (uint16)(((value * ((uint32)ADC2_VREF_mV * (uint16)VDDC_ATTEN_CONV_NOMIN)) / (uint16)ADC2_FILTOUT_MAX) / (uint8)VDDC_ATTEN_CONV_DENOM);
  return (value);
}

/** \brief Returns the Temperature read by the ADC2 Channel 9 in degrees Celsius (&deg;C).
 * \brief \f$ Temp(&deg;C) = \frac{V_{Temp}(mV)-666(mV)}{2.31\frac{(mV)}{(&deg;C)}}\f$
 * \brief \n where
 * \brief \n \f$ V_{Temp}(mV) = \frac{ADC2.Digital.Result(bit)*(V_{BG}*1000)(mV)}{ADC2.Max.Digital.Value(bit)}\f$
 *
 * \return Temperature read by the ADC2 Channel 9 in degrees Celsius (&deg;C).
 *
 * \brief <b>Example</b><br>
 * \brief This example returns the specified value./
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     sint16 data;
 *
 *     data = ADC2_Temp_Result_C();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup adc2_api
 */
INLINE sint16 ADC2_Temp_Result_C(void)
{
  uint16 value;
  uint16 V_Temp_mV;
  sint16 Temperature;
  value = ADC2_GetChResult((uint8)ADC2_TEMP);
  /* Conversion for Temperature in deg C:
  Step 1: Calculate V_Temp(T)(mV): */
  V_Temp_mV = (uint16)(((uint32)value * (uint32)ADC2_VREF_mV) / (uint16)1023);
  /* Step 2: Conversion from V_Temp(T)(mV) to Temperature in deg C  */
  Temperature = (sint16)((((sint16)V_Temp_mV - (sint16)V_TEMP_REF_OFFSET_mV) * (sint16)V_TEMP_SCALE_FACT) / (sint16)CONV_COEFF_mV_TO_degC);
  /* return the calculated Temperature in deg C */
  return (Temperature);
}

#endif
